In [1]:
import numpy as np
import pandas as pd

练习目的：
对比两组不同等级的数据，通过求解z score使得他们的标准一致，从而使得两组数据可以同等scale展示

In [9]:
#设置随机种子数seed（100）
np.random.seed(100)
#初始化一个df对象
df = pd.DataFrame()
#设置df一列为income，赋值一个100个数字，符合以50000为中心均值，10000为标准差
df['income'] = np.random.normal(50000, scale=10000, size=100)
#设置df一列为age，赋值100个数字，符合以40为均值，10为标准差
df['age'] = np.random.normal(40, scale=10, size=100)
#将df的数组数据转换为整数
df = df.astype(int)

In [10]:
#显示前5行
df.head()

   income  age
0   32502   22
1   53426   28
2   61530   10
3   47475   40
4   59813   37

In [11]:
#查看df的情况
df.describe()

             income         age
count    100.000000  100.000000
mean   48957.850000   38.770000
std     9746.405471   10.646624
min    25128.000000   10.000000
25%    41525.500000   32.000000
50%    49634.500000   38.000000
75%    56762.250000   46.250000
max    70346.000000   62.000000

In [12]:
#查看df的标准差
df.std()

income    9746.405471
age         10.646624
dtype: float64

In [13]:
#查看df的平均数
df.mean()

income    48957.85
age          38.77
dtype: float64

In [14]:
#设置一列名为z_income，计算公式求z score，即（每个数-平均值）/标准差
df['z_income'] = (df['income'] - df['income'].mean())/df['income'].std()
#设置一列名为z_age，计算z score
df['z_age'] = (df['age'] - df['age'].mean())/df['age'].std()

In [15]:
#查看结果
df.head()

   income  age  z_income     z_age
0   32502   22 -1.688402 -1.575147
1   53426   28  0.458441 -1.011588
2   61530   10  1.289927 -2.702265
3   47475   40 -0.152143  0.115530
4   59813   37  1.113759 -0.166250

In [16]:
#查看详细信息
df.describe()

             income         age      z_income         z_age
count    100.000000  100.000000  1.000000e+02  1.000000e+02
mean   48957.850000   38.770000  1.376677e-16 -3.219647e-16
std     9746.405471   10.646624  1.000000e+00  1.000000e+00
min    25128.000000   10.000000 -2.444989e+00 -2.702265e+00
25%    41525.500000   32.000000 -7.625734e-01 -6.358823e-01
50%    49634.500000   38.000000  6.942560e-02 -7.232339e-02
75%    56762.250000   46.250000  8.007465e-01  7.025701e-01
max    70346.000000   62.000000  2.194465e+00  2.181912e+00

In [8]:
#查看标准差
df.std()

income      9746.405471
age           10.646624
z_income       1.000000
z_age          1.000000
dtype: float64

In [17]:
#查看平均数
df.mean()

income      4.895785e+04
age         3.877000e+01
z_income    1.376677e-16
z_age      -3.219647e-16
dtype: float64